src/test/resources/plays/multipayment/capture_pre_authorized.yaml

!play
interactions:
-
  request:
    uri: /v2/multipayments/MPY-EVAWT7HR8QEP/capture
    headers:
      Content-Type: application/json
      Authorization: OAuth 8833c9eb036543b6b0acd685a76c9ead_v2
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {
          "id": "MPY-EVAWT7HR8QEP",
          "status": "AUTHORIZED",
          "amount": {
              "total": 8000,
              "currency": "BRL"
          },
          "installmentCount": 1,
          "payments": [
              {
                  "id": "PAY-8JYH1UX882LL",
                  "status": "AUTHORIZED",
                  "delayCapture": true,
                  "amount": {
                      "total": 4000,
                      "gross": 4000,
                      "fees": 289,
                      "refunds": 0,
                      "liquid": 3711,
                      "currency": "BRL"
                  },
                  "installmentCount": 1,
                  "fundingInstrument": {
                      "creditCard": {
                          "id": "CRC-2HY3YCJS9WPD",
                          "brand": "MASTERCARD",
                          "first6": "555566",
                          "last4": "8884",
                          "store": true,
                          "holder": {
                              "birthdate": "1988-12-30",
                              "birthDate": "1988-12-30",
                              "taxDocument": {
                                  "type": "CPF",
                                  "number": "33333333333"
                              },
                              "fullname": "Jose Portador da Silva"
                          }
                      },
                      "method": "CREDIT_CARD"
                  },
                  "acquirerDetails": {
                      "authorizationNumber": "123456",
                      "taxDocument": {
                          "type": "CNPJ",
                          "number": "01027058000191"
                      }
                  },
                  "fees": [
                      {
                          "type": "TRANSACTION",
                          "amount": 289
                      }
                  ],
                  "events": [
                      {
                          "type": "PAYMENT.AUTHORIZED",
                          "createdAt": "2018-08-07T14:26:13.470-03"
                      },
                      {
                          "type": "PAYMENT.IN_ANALYSIS",
                          "createdAt": "2018-08-07T14:25:47.000-03"
                      },
                      {
                          "type": "PAYMENT.PRE_AUTHORIZED",
                          "createdAt": "2018-08-07T14:25:47.000-03"
                      },
                      {
                          "type": "PAYMENT.CREATED",
                          "createdAt": "2018-08-07T14:25:46.000-03"
                      },
                      {
                          "type": "PAYMENT.WAITING",
                          "createdAt": "2018-08-07T14:25:46.000-03"
                      }
                  ],
                  "receivers": [
                      {
                          "moipAccount": {
                              "id": "MPA-VB5OGTVPCI52",
                              "login": "lojista_1@labs.moip.com.br",
                              "fullname": "Chris Coyier Moip"
                          },
                          "type": "PRIMARY",
                          "amount": {
                              "total": 4000,
                              "currency": "BRL",
                              "fees": 289,
                              "refunds": 0
                          },
                          "feePayor": true
                      }
                  ],
                  "_links": {
                      "self": {
                          "href": "https://sandbox.moip.com.br/v2/payments/PAY-8JYH1UX882LL"
                      },
                      "order": {
                          "href": "https://sandbox.moip.com.br/v2/orders/ORD-HTQ7DYWIBC6R",
                          "title": "ORD-HTQ7DYWIBC6R"
                      }
                  },
                  "createdAt": "2018-08-07T14:25:46.000-03",
                  "updatedAt": "2018-08-07T14:26:13.469-03"
              },
              {
                  "id": "PAY-CU2X09XRBJU4",
                  "status": "AUTHORIZED",
                  "delayCapture": true,
                  "amount": {
                      "total": 4000,
                      "gross": 4000,
                      "fees": 289,
                      "refunds": 0,
                      "liquid": 3711,
                      "currency": "BRL"
                  },
                  "installmentCount": 1,
                  "fundingInstrument": {
                      "creditCard": {
                          "id": "CRC-2HY3YCJS9WPD",
                          "brand": "MASTERCARD",
                          "first6": "555566",
                          "last4": "8884",
                          "store": true,
                          "holder": {
                              "birthdate": "1988-12-30",
                              "birthDate": "1988-12-30",
                              "taxDocument": {
                                  "type": "CPF",
                                  "number": "33333333333"
                              },
                              "fullname": "Jose Portador da Silva"
                          }
                      },
                      "method": "CREDIT_CARD"
                  },
                  "acquirerDetails": {
                      "authorizationNumber": "123456",
                      "taxDocument": {
                          "type": "CNPJ",
                          "number": "01027058000191"
                      }
                  },
                  "fees": [
                      {
                          "type": "TRANSACTION",
                          "amount": 289
                      }
                  ],
                  "events": [
                      {
                          "type": "PAYMENT.AUTHORIZED",
                          "createdAt": "2018-08-07T14:26:13.471-03"
                      },
                      {
                          "type": "PAYMENT.IN_ANALYSIS",
                          "createdAt": "2018-08-07T14:25:47.000-03"
                      },
                      {
                          "type": "PAYMENT.PRE_AUTHORIZED",
                          "createdAt": "2018-08-07T14:25:47.000-03"
                      },
                      {
                          "type": "PAYMENT.CREATED",
                          "createdAt": "2018-08-07T14:25:46.000-03"
                      },
                      {
                          "type": "PAYMENT.WAITING",
                          "createdAt": "2018-08-07T14:25:46.000-03"
                      }
                  ],
                  "receivers": [
                      {
                          "moipAccount": {
                              "id": "MPA-IFYRB1HBL73Z",
                              "login": "lojista_3@labs.moip.com.br",
                              "fullname": "Lojista 3 Moip"
                          },
                          "type": "PRIMARY",
                          "amount": {
                              "total": 3945,
                              "currency": "BRL",
                              "fees": 289,
                              "refunds": 0
                          },
                          "feePayor": true
                      },
                      {
                          "moipAccount": {
                              "id": "MPA-KQB1QFWS6QNM",
                              "login": "secundario_1@labs.moip.com.br",
                              "fullname": "Maria da Silva Santos"
                          },
                          "type": "SECONDARY",
                          "amount": {
                              "total": 55,
                              "currency": "BRL",
                              "fees": 0,
                              "refunds": 0
                          },
                          "feePayor": false
                      }
                  ],
                  "_links": {
                      "self": {
                          "href": "https://sandbox.moip.com.br/v2/payments/PAY-CU2X09XRBJU4"
                      },
                      "order": {
                          "href": "https://sandbox.moip.com.br/v2/orders/ORD-0HS3WT81WLWH",
                          "title": "ORD-0HS3WT81WLWH"
                      }
                  },
                  "createdAt": "2018-08-07T14:25:46.000-03",
                  "updatedAt": "2018-08-07T14:26:13.470-03"
              }
          ],
          "_links": {
              "self": {
                  "href": "https://sandbox.moip.com.br/v2/multipayments/MPY-EVAWT7HR8QEP"
              },
              "multiorder": {
                  "href": "https://sandbox.moip.com.br/v2/multiorders/MOR-ZB4W3W0S0NUF"
              }
          }
      }